app/Controllers/Admin/Cliente.php

SELECT *
FROM `cliente`
---
    public function mostrarcliente()  {

        $clienteModel = model("ClienteModel");
        $data['clientes'] = $clienteModel->findAll();