app/Controllers/Admin/Cuidado.php

SELECT *
FROM `cuidados`
---
    public function mostrarcuidado() {

        $cuidadoModel = model("CuidadoModel");
        $data['cuidados'] = $cuidadoModel->findAll();