app/Controllers/Admin/Veterinario.php

    public function mostrarveterinario() {

        $veterinarioModel = model("VeterinarioModel");
        $data['veterinarios'] = $veterinarioModel->findAll();
---
SELECT *
FROM `veterinario`

    public function insertar() {
        $veterinarioModel = model("VeterinarioModel");
        $data = [
            "nombre"=> $_POST["nombre"],
            "direccion"=> $_POST["direccion"],
            "telefono"=> $_POST["telefono"],
        ];
        $veterinarioModel->insert($data, false);
---
INSERT INTO `veterinario` (`nombre`, `direccion`, `telefono`) VALUES ('Pepe el picas', 'Calle de las Papas 28', '1234567890')

    public function buscarveterinario() {
        $veterinarioModel = model('VeterinarioModel');
        if(isset($_GET['nombre'])){
            $nombre=$_GET['nombre'];
            $direccion=$_GET['direccion'];
            $telefono=$_GET['telefono'];
            $data['veterinarios']=$veterinarioModel->like('nombre',$nombre)
            ->like('direccion', $direccion)->like('telefono', $telefono)
            ->findAll();
        }
        else{
            $nombre="";
            $data['veterinarios']=$veterinarioModel->findAll();
---
SELECT *
FROM `veterinario`

    public function actualizarveterinario() {
        $veterinarioModel = model('VeterinarioModel');
        $data = array(
            "nombre"=> $_POST['nombre'],
            "direccion"=> $_POST['direccion'],
            "telefono"=> $_POST['telefono']
        );
        $veterinarioModel->update($_POST['id'], $data);
---
UPDATE `veterinario` SET `nombre` = 'Carlos Rodríguez edit', `direccion` = 'Avenida de las Mascotas 567 edit', `telefono` = '555-567-8901 edit'
WHERE `veterinario`.`id_veterinario` IN ('2')